Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/claiming_a_social_welfare_payment/claiming_two_social_welfare_payments.html.txt.tmx
Source language: en
Languages: ga

source: Claiming an extra half-rate social welfare payment
ga: Ag éileamh íocaíocht leasa shóisialaigh bhreise ar leathráta

source: It is generally only possible to claim one personal social assistance or social insurance payment at a time in Ireland
ga: Go hiondúil ní féidir ach íocaíocht chúnaimh shóisialta phearsanta amháin nó íocaíocht árachais shóisialta amháin a éileamh ag aon uair amháin in Éirinn

source: However, in some circumstances, you can keep your personal payment and get half of another social welfare payment
ga: I roinnt cúinsí, áfach, féadann tú d'íocaíocht phearsanta a choinneáil agus leath d'íocaíocht leasa shóisialaigh eile a fháil

source: If you are getting certain social welfare payments and you are providing full-time care and attention to another person, you can keep your main social welfare payment and get half-rate Carer’s Allowance as well
ga: Ó 27 Meán Fómhair 2007 má tá tú ag fáil íocaíochtaí leasa shóisialaigh áirithe agus ag tabhairt aire do dhaoine atá ag brath ar chúram lán aimseartha, féadann tú do phríomh íocaíocht a choinneáil agus Liúntas Cúramóra ar leathráta a fháil

source: More information can be found in our document about qualifying for half-rate Carer's Allowance
ga: Tá tuilleadh eolais faoi cáiliú le haghaidh Liúntais Cúramóra

source: You can get a half-rate Maternity, Paternity, Adoptive or Health and Safety Benefit payment if you are claiming one of the following social welfare payments:
ga: Íocfar Sochar Máithreachais, Sochar Atharthachta, Sochar Sábháilteachta agus Sláinte ó Sochar Uchtaíoch leat ag leath an ráta má tá tú ag fáil aon cheann de na híocaíochtaí seo a leanas:

source: • Death benefits or survivor's benefits under the Occupational Injuries Benefit Scheme, such as Widow's, Widower's or Surviving Civil Partner's Pension and Dependant Parent Pension
ga: • Sochair bháis nó sochair mharthanóra faoi Scéim na Sochar Gortuithe Ceirde, cosúil le Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh agus Pinsean Tuismitheora Cleithiúnaigh

source: │Social insurance payment │Half-rate │
ga: │Íocaíocht Árachais Shóisialta │2017 leathráta │

source: │Maternity Benefit (standard rate €235) │€117.50 │
ga: │Sochar Máithreachais │€117.50 │

source: │Paternity Benefit (standard rate €235) │€117.50 │
ga: │Sochar Atharthachta │€117.50 │

source: │Adoptive Benefit (standard rate €235) │€117.50 │
ga: │Sochar Uchtaíoch │€117.50 │

source: │Health and Safety Benefit (maximum rate €193) │€96.50 │
ga: │Sochar Sábháilteachta agus Sláinte (uasráta) │€96.50 │

source: If you are working and on a reduced social welfare payment you may get more than half-rate Maternity, Paternity, Adoptive or Health and Safety Benefit when you stop working
ga: Má tá tú ag obair agus ag fáil íocaíocht leasa shóisialaigh ar ráta laghdaithe, d'fhéadfá Sochar Máithreachais,Sochar Atharthachta, Sochar Sábháilteachta agus Sláinte ó Sochar Uchtaíoch ag níos mó ná leathráta a fháil nuair a stopfaidh tú de bheith ag obair

source: To claim half of an additional social welfare payment, you apply in the normal way
ga: Chun leath d'íocaíocht bhreise leasa shóisialaigh a éileamh, déanann tú iarratas ar an ngnáthbhealach

source: You should fill out the correct payment application form and return it to the Department of Social Protection
ga: Ba chóir duit an fhoirm iarratais íocaíochta cheart a chomhlánú agus í a sheoladh ar ais chuig an Roinn Coimirce Sóisialaí

source: The return address is printed on the application form
ga: Tá an seoladh fillte foilsithe ar chúl na foirme iarratais
